src/DataProcessors/ОбменДаннымиССайтом_Регламент_Заявки_Express.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОбменДаннымиССайтом_Регламент_Заявки_Express</Name>
			<Comment>предназначена для вызова процедуры загрузки документов отдельно от справочных данных</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаССайтом_ЗаявкиПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаССайтом_ЗаявкиПокупателей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПринятого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/НастройкиРеквизитовДляОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиРеквизитовДляОбменов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтрокаДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДляРабочейБазы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДляТестовойБазы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ОбменДаннымиССайтом_Регламент_Заявки_Express/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУзлаОбмена) тогда
		ВызватьИсключение "Не заполнен реквизит ""Узел обмена"" Отправителя.";		
	КонецЕсли;
	
	URI = "http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema";
	Настройка = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_Сайт_Заявки_Express;
	АдресВебСервиса = ?(ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза(), Настройка.СтрокаДляРабочейБазы, Настройка.СтрокаДляТестовойБазы);
	МетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт_состояние_заявок_exp;
	МенеджерПланаОбмена = ПланыОбмена.ОбменПартКом83_Сайт_состояние_заявок_exp;
	
	Получатель = МенеджерПланаОбмена.ЭтотУзел();
	Отправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(МетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
	Если НЕ ЗначениеЗаполнено(Отправитель) тогда
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,МенеджерПланаОбмена.ПустаяСсылка(),"",,Истина,"Не найден отправитель сообщения в списке узлов.");
		//)Семенов И.П.
		ВызватьИсключение "[ЗагрузитьСообщениеОбмена]: не найден отправитель сообщения в списке узлов.";	
	КонецЕсли;                                                                      		
	
	КодПолучателя = Получатель.ИдентификаторУзла;
	КодОтправителя = ИдентификаторУзлаОбмена;
	НомерПринятого = Отправитель.НомерОтправленного;
	
	//Семенов И.П. 06.02.2019 XX-1768(
	Попытка
	//)Семенов И.П.
		Определения = Новый WSОпределения(АдресВебСервиса);
		Прокси = Новый WSПрокси(Определения, Определения.Сервисы[0].URIПространстваИмен, Определения.Сервисы[0].Имя, Определения.Сервисы[0].ТочкиПодключения[0].Имя);
		
		ОтветСервера = Прокси.GetExchangeMessage("orders_express_nn", КодПолучателя, НомерПринятого);
		РаспакованноеСообщение = ОбменДаннымиСервер.РаспаковатьСообщениеОбмена(ОтветСервера);
		
		ТипСообщениеОбмена = ФабрикаXDTO.Тип(URI, "СообщениеОбмена");
		ЧтениеХМЛ = Новый ЧтениеXML;
		ЧтениеХМЛ.УстановитьСтроку(РаспакованноеСообщение);
		ДанныеХДТО = ФабрикаXDTO.ПрочитатьXML(ЧтениеХМЛ, ТипСообщениеОбмена);
		ОбъектыXDTO = ДанныеХДТО.Объекты.ПолучитьСписок("Объект");
	//Семенов И.П. 06.02.2019 XX-1768(
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,Отправитель,"",,Истина,ТекстОшибки);
		ВызватьИсключение "[ЗагрузитьСообщениеОбмена]: "+ТекстОшибки;
	КонецПопытки;
	//)Семенов И.П.
	
	НомерСообщения = ДанныеХДТО.НомерСообщения;
	Если НомерСообщения <= НомерПринятого Тогда
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(НомерСообщения,Отправитель,РаспакованноеСообщение,,Истина,"Неправильное значение элемента ""НомерСообщения"": сообщение с таким номером уже загружалось.");
		//)Семенов И.П.
		ВызватьИсключение "[ЗагрузитьСообщениеОбмена]: неправильное значение элемента ""НомерСообщения"": сообщение с таким номером уже загружалось.";
	КонецЕсли;
	
	Если ОбъектыXDTO.Количество() > 0 Тогда
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.НачатьЗаписьВИсториюОбменовПоОбъектам();
		//)Семенов И.П.
		РегистрыСведений.ИсторияОбменаССайтом_ЗаявкиПокупателей.ЗарегистрироватьСообщение(КодОтправителя, КодПолучателя, ОтветСервера, НомерПринятого);
		ПланыОбмена.ОбменПартКом83_Сайт_состояние_заявок.ОбработатьПакетЗаявокССайта(ОбъектыXDTO, URI, НомерСообщения, Истина);
	КонецЕсли;
	
	//Семенов И.П. 06.02.2019 XX-1768(
	ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(НомерСообщения,Отправитель,РаспакованноеСообщение);
	//)Семенов И.П.
	
	ОбъектУзла = Отправитель.ПолучитьОбъект();
	ОбъектУзла.НомерОтправленного = НомерСообщения;
	ОбъектУзла.Записать();
	
КонецПроцедуры
